[
  {
    "ShortDescription": "City Center",
    "LongDescription": "You are standing in the heart of the city. Tall buildings surround you, and there's a buzz of activity. To the east is the Financial District, to the south is the Residential Area, and to the west is the Park District.",
    "X": 0,
    "Y": 0,
    "Resident": {
      "Name": "Mayor Greene",
      "Quest": {
        "Description": "Reduce the environmental impact of cities.",
        "Good": {
          "Action": "Promote green buildings.",
          "Outcome": "The city starts adopting more sustainable building practices!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Attend a city council meeting.",
          "Outcome": "You learned more about the city's challenges, but didn't directly contribute to solutions.",
          "Score": 0
        },
        "Bad": {
          "Action": "Drive around without purpose.",
          "Outcome": "This only contributes to air pollution!",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Financial District",
    "LongDescription": "Skyscrapers tower above, housing the city's financial institutions. The streets are busy with working professionals.",
    "X": 1,
    "Y": 0,
    "Resident": {
      "Name": "Banker Bonnie",
      "Quest": {
        "Description": "Strengthen efforts to protect and safeguard the world’s cultural and natural heritage.",
        "Good": {
          "Action": "Donate to restoration of historical sites.",
          "Outcome": "You've contributed to preserving the city's rich history!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Visit a museum.",
          "Outcome": "You appreciated the city's heritage but didn't actively contribute.",
          "Score": 0
        },
        "Bad": {
          "Action": "Ignore and walk past historical landmarks.",
          "Outcome": "Ignoring history might lead to its degradation.",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Park District",
    "LongDescription": "A breath of fresh air in the city, this district has greenery, playgrounds, and a serene lake.",
    "X": -1,
    "Y": 0,
    "Resident": {
      "Name": "Ranger Rick",
      "Quest": {
        "Description": "Provide universal access to safe, inclusive and accessible green and public spaces.",
        "Good": {
          "Action": "Plant trees and promote community gardens.",
          "Outcome": "The district is even greener and community-driven!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Attend a park event.",
          "Outcome": "You enjoyed the green space but didn't leave a lasting impact.",
          "Score": 0
        },
        "Bad": {
          "Action": "Litter in the park.",
          "Outcome": "That's not helping the city's sustainability goals!",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Residential Area",
    "LongDescription": "Rows of houses, apartments, and some local shops define this district. Families and children are often seen playing.",
    "X": 0,
    "Y": 1,
    "Resident": {
      "Name": "Neighbor Nancy",
      "Quest": {
        "Description": "Ensure access for all to adequate, safe and affordable housing and basic services.",
        "Good": {
          "Action": "Volunteer in community housing projects.",
          "Outcome": "You've helped ensure everyone has a roof over their heads!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Participate in a local yard sale.",
          "Outcome": "It's community engagement, but not directly aiding housing access.",
          "Score": 0
        },
        "Bad": {
          "Action": "Hoard properties and drive up rents.",
          "Outcome": "That's going against the goal of affordable housing for all.",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Industrial Zone",
    "LongDescription": "Factories and warehouses dominate the landscape. You hear the distant hum of machinery.",
    "X": 1,
    "Y": 1,
    "Resident": {
      "Name": "Factory Foreman Frank",
      "Quest": {
        "Description": "Reduce the adverse environmental impact of industries.",
        "Good": {
          "Action": "Implement green manufacturing processes.",
          "Outcome": "The industrial impact on the environment has been lessened!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Take a tour of a factory.",
          "Outcome": "You're more informed but didn't directly reduce impacts.",
          "Score": 0
        },
        "Bad": {
          "Action": "Waste resources and produce non-recyclable goods.",
          "Outcome": "This just adds to the environmental burden.",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Cathedra Oculi Sanguinei",
    "LongDescription": "It's an old cathedral where the paint is peeling off the walls. Inside, the atmosphere is dimly lit with dust floating in the air and the hauntingly beautiful sound of a piano resonating through the pews.",
    "X": -2,
    "Y": 0,
    "Resident": {
      "Name": "The Pianist",
      "Quest": {
        "Description": "Immerse in the melodies of the past and feel the soul of the cathedral through its music.",
        "Good": {
          "Action": "Help restore the cathedral and organize a concert.",
          "Outcome": "The restored cathedral becomes a beacon of culture, drawing in crowds and reviving its legacy.",
          "Score": 10
        },
        "Neutral": {
          "Action": "Sit and listen to the music, appreciating the moment.",
          "Outcome": "You're moved by the music, leaving with a sense of peace, but the cathedral remains unchanged.",
          "Score": 0
        },
        "Bad": {
          "Action": "Ignore the cathedral's charm and leave.",
          "Outcome": "The music fades behind you, and the cathedral's decline continues, unnoticed.",
          "Score": -5
        }
      }
    }
  },
  {
    "ShortDescription": "Springfield Elementary",
    "LongDescription": "Springfield Elementary, once a beacon of hope and knowledge, now looks more like a relic of the past. The paint's faded memories of student art projects. The swings in the playground have developed an unscheduled 'squeak-period'. Principal Skinner, however, stands outside, with an unmistakable gleam in his eyes, holding a banner that reads 'Help Restore Our Glory... and also our Science Lab'. The school's mission? To teach sustainability, not just practice it.",
    "X": 0,
    "Y": 2,
    "Resident": {
      "Name": "Principal Skinner",
      "Quest": {
        "Description": "Restore the school's facilities to ensure a conducive learning environment.",
        "Good": {
          "Action": "Donate to the school's restoration fund.",
          "Outcome": "Your generosity has sparked a wave of community support and started the restoration!",
          "Score": 10
        },
        "Neutral": {
          "Action": "Participate in a school community day.",
          "Outcome": "You spent a day getting to know the staff and students, bringing a bit of cheer.",
          "Score": 0
        },
        "Bad": {
          "Action": "Disregard the school's plea for help.",
          "Outcome": "The school continues to decline, as does the quality of education.",
          "Score": -5
        }
      }
    }
  }  
]